tap "epk/epk"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line interface for SQLite
brew "sqlite"
# General-purpose data compression with high compression ratio
brew "xz"
# High-performance theorem prover
brew "z3"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Next-gen compiler infrastructure
brew "llvm"
# Language Server for the Lua language
brew "lua-language-server"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# OpenResty's Branch of LuaJIT 2
brew "luajit-openresty"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# Fast, disk space efficient package manager
brew "pnpm"
# Modern replacement for ps written by Rust
brew "procs"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Web search from the terminal
brew "s-search"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Utilities designed to make common development tasks easier
cask "devtoys"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Apple's SF Mono font patched with the Nerd Fonts patcher for Powerline support
cask "font-sf-mono-for-powerline"
cask "font-sf-mono-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Clipboard manager
cask "maccy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
vscode "andrsdc.base16-themes"
vscode "atomiks.moonlight"
vscode "catppuccin.catppuccin-vsc"
vscode "chiragpat.tomorrow-and-tomorrow-night-operator-mono-theme"
vscode "cschlosser.doxdocgen"
vscode "enkia.tokyo-night"
vscode "fmailscammer.gruber-almost"
vscode "franciscosilva.gruber-darker"
vscode "gruntfuggly.todo-tree"
vscode "jdinhlife.gruvbox"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jmreicha.tender"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "panicbit.cargo"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "serayuzgur.crates"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
vscode "vscodevim.vim"
